# Pandas


Pandas is the most popular python library used for data science and with good reason: it offers powerful, expressive and flexible data structures that make data manipulation and analysis easy, among many other things.

What’s cool about Pandas is that it takes data (like a CSV or Excel or a SQL database) and creates a Python object with rows and columns called dataframe that looks very similar to table in a statistical software (think Excel).

As well as offering a convenient storage interface for labeled data, Pandas implements a number of powerful data operations familiar to users of both database frameworks and spreadsheet programs.

### Installation and getting started

To be able to use Pandas we need to import the library first. Importing a library means loading it into memory and then it's there for us to work with it.
To import Pandas all you have to do is run the following lines:

In [2]:
import pandas as pd 
#usually we add the second part 'as pd' so we can access it with 'pd.command' instead of 'pandas.command'

import numpy as np

### Pandas Data Structures

At the very basic level, Pandas objects can be thought of as enhanced versions of NumPy structured arrays in which the rows and columns are identified with labels rather than simple integer indices.

#### The Pandas Series Object

<br>
A one-dimensional labeled array capable of holding any data type

In [3]:
s = pd.Series([3, -5, 7, 4],  index=['a',  'b',  'c',  'd'])
s

a    3
b   -5
c    7
d    4
dtype: int64

**DataFrame** <br>
A two-dimensional labeled data structure with columns of potentially different types. <br>
In general, you could say that the Pandas DataFrame consists of three main components: the data, the index, and the columns.

A DataFrame can contain data that is:
- a Pandas `DataFrame`
- a Pandas `Series`
- a NumPy `ndarray`
- dictionaries of one-dimensional `ndarray`’s, lists, dictionaries or Series.

Note the difference between `np.ndarray` and `np.array()`.The former is an actual data type, while the latter is a function to make arrays from other data structures.

In [5]:
data = {'Country': ['Belgium',  'India',  'Brazil'],

        'Capital': ['Brussels',  'New Delhi',  'Brasilia'],

        'Population': [11190846, 1303171035, 207847528]}

df = pd.DataFrame(data, columns=['Country',  'Capital',  'Population'])

In [6]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

### Loading and Saving Data with Pandas

Usually, when we use pandas for data analysis, we’ll use it in one of three different ways:
- Convert a Python’s list, dictionary or Numpy array to a Pandas data frame
- Open a local file using Pandas, usually a CSV or Excel file
- Open a remote file or database like a CSV or a JSONon a website through a URL or read from a SQL table/database

**Read and Write to CSV**

In [7]:
#write to csv file
df.to_csv('csv_example.csv')

#read from csv file
df_csv = pd.read_csv('csv_example.csv')
df_csv

   Unnamed: 0  Country    Capital  Population
0           0  Belgium   Brussels    11190846
1           1    India  New Delhi  1303171035
2           2   Brazil   Brasilia   207847528

Well, we can see that the index is generated twice, the first one is loaded from the CSV file, while the second one, i.e `Unnamed` is generated automatically by Pandas while loading the CSV file.

This problem can be avoided by making sure that the writing of CSV files doesn’t write indexes, because `DataFrame` will generate it anyway. We can do the same by specifying `index = False` parameter in `to_csv(...)` function.

In [8]:

df.to_csv('csv_example', index=False)

df_csv = pd.read_csv('csv_example')
df_csv

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

**Read and Write to Excel**

In [9]:
#write to excel
df.to_excel('excel-example.xlsx', index=False, sheet_name='Sheet1')

#read from excel
df_excel = pd.read_excel('excel-example.xlsx')
df_excel

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

### Selection of Data

In [11]:
#get subset of a DataFrame
df[1:] #starting from row with index 1 and all columns

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasilia   207847528

In [12]:
#to select the first row 
df.iloc[[0],:]

   Country   Capital  Population
0  Belgium  Brussels    11190846

By Position <br>

In [14]:
# Select single value by row and and column
#first element of the first column
df.iloc[[0],[0]]

   Country
0  Belgium

In [15]:
#Select multiple values by row and and column
df.iloc[1:3,[1]] #rows 1 and 2 and just column with index 1-> Capital

     Capital
1  New Delhi
2   Brasilia

In [16]:
df.iloc[[0,2],[1]] #rows with index 0 and 2 and column indexd at 1-> Capital

    Capital
0  Brussels
2  Brasilia

By Label

In [13]:
#Select single value by row and column labels
df.loc[1, 'Country']

'India'

In [14]:
#Select multiple values by row and column labels
df.loc[0:1,['Capital', 'Country']]

     Capital  Country
0   Brussels  Belgium
1  New Delhi    India

### Filter, Sort and Groupby

In [17]:
#You can use different conditions to filter columns
df[df['Population']<12000000]

   Country   Capital  Population
0  Belgium  Brussels    11190846

In [18]:
#sort values in a column in ascending order using df.sort_values(col1)
df.sort_values('Country')

   Country    Capital  Population
0  Belgium   Brussels    11190846
2   Brazil   Brasilia   207847528
1    India  New Delhi  1303171035

In [19]:
#or in dscending order
df.sort_values('Country', ascending=False)

   Country    Capital  Population
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528
0  Belgium   Brussels    11190846

In [20]:
#also possible to sort ascending by one column and descending by another one
df.sort_values(['Country','Population'],ascending=[True,False])

   Country    Capital  Population
0  Belgium   Brussels    11190846
2   Brazil   Brasilia   207847528
1    India  New Delhi  1303171035

### Viewing and Inspecting Data
**Basic Information**

In [21]:
#get the first n rows
df.head(2)

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035

In [22]:
#get the last n rows
df.tail(2)

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasilia   207847528

In [23]:
#get the nr of rows and columns
print(df.shape)

#describe the columns
print(df.columns)

#get the index, datatype and memory information
df.info()

#Number of non-NA values
df.count()

(3, 3)
Index(['Country', 'Capital', 'Population'], dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
Country       3 non-null object
Capital       3 non-null object
Population    3 non-null int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

Country       3
Capital       3
Population    3
dtype: int64

In [25]:
df.count()

Country       3
Capital       3
Population    3
dtype: int64

**Summary information**
<br>
To get statistics on the entire dataframe or a series we can use: 
- `df.mean()` Returns the mean of all columns
- `df.corr()` Returns the correlation between columns in a data frame
-  `df.count()` Returns the number of non-null values in each data frame column
-  `df.max()` Returns the highest value in each column
-  `df.min()` Returns the lowest value in each column
-  `df.median()` Returns the median of each column
- `df.std()` Returns the standard deviation of each column

In [49]:
#creating a bigger dataframe with random integers and using some example functions
dataf = pd.DataFrame(data = np.random.randn(50, 4), columns = ['A', 'B', 'C', 'D'])
dataf

           A         B         C         D
0  -0.254929 -0.808311  2.137055  1.268987
1   0.223646 -0.455673  0.355199 -1.663376
2  -2.532470 -1.694096 -0.432546 -0.341093
3  -1.198531 -0.384605 -0.368347  0.566197
4   0.505959 -0.615023 -1.316505  1.331835
5  -0.068528  0.102743 -0.235474  0.666361
6  -1.646008 -0.765082  0.756714  0.615528
7  -0.816201  2.411653 -0.878649  0.510363
8  -0.914156 -1.245752 -0.893270  0.433378
9   1.283184 -2.005857 -0.293617 -0.151975
10 -0.598430 -1.205000 -0.209753 -0.243291
11  0.897859  0.831789 -0.362199  0.718162
12  1.533647 -1.189756  0.538834  0.285050
13 -1.349351 -0.821386  1.516357  0.330736
14 -0.057641  0.165006  0.587258 -0.671662
15 -0.222375  0.201429  1.023988  0.365442
16 -0.722409  2.075656 -0.708131  0.049437
17  0.812610 -0.134202 -1.219731  0.376340
18  1.644310  0.931820  0.283015 -0.669808
19 -1.232661  1.162186  0.126129  1.357174
20 -0.699622 -1.778351  2.441241 -0.993816
21 -3.291571 -0.033284 -1.046927  0.203041
22 -0.207087 -1.564522 -0.283407 -1.319987
23 -1.700432  0.098758 -0.780464 -0.529731
24 -0.058050  1.650126  0.496007  1.645966
25 -1.165334  0.762552 -1.963981  0.004354
26 -0.128509  1.289546  0.595402 -0.409122
27 -1.468812 -1.274961 -0.442755 -0.914892
28 -0.182299  0.163811  0.508904  0.751762
29  1.472406 -0.665502 -0.475159  1.069714
30  0.014979 -0.313594 -0.562988 -0.050088
31 -0.907394 -1.301312  1.224020  0.252917
32  0.790535  0.816258  1.134608  0.229913
33  0.092260 -2.172551 -0.399180 -0.260161
34  1.986861 -0.605954  0.025069  0.117047
35 -2.344467 -1.818681 -0.173265  0.509990
36 -1.281992 -0.766642  0.338510  1.072474
37 -0.502833  0.767331 -0.905428 -1.385045
38 -0.884941 -0.498249 -0.341377  0.565567
39  2.697299  0.457996  1.061381 -1.133273
40 -1.131026 -0.997799  1.455748 -0.680614
41  0.162183 -1.078826  1.875005  0.820358
42 -0.057483  1.144778  1.301616 -0.659844
43  0.018111 -0.552647 -0.284547  0.041761
44  1.466573  0.410361  0.846741  0.616687
45 -0.218987 -0.793900  0.861203  0.043323
46 -2.013277 -0.056525  0.227580 -0.317018
47 -0.538831  1.694163  0.391878 -1.061725
48 -0.116781  0.211711  0.856749 -1.275787
49  1.051444  0.954225 -0.688367 -1.645204

In [50]:
dataf.mean()

A   -0.277191
B   -0.185883
C    0.154003
D    0.008847
dtype: float64

In [51]:
dataf.corr()

          A         B         C         D
A  1.000000  0.139496  0.132725 -0.070877
B  0.139496  1.000000 -0.135891  0.002460
C  0.132725 -0.135891  1.000000 -0.019024
D -0.070877  0.002460 -0.019024  1.000000

In [52]:
dataf.dropna()

           A         B         C         D
0  -0.254929 -0.808311  2.137055  1.268987
1   0.223646 -0.455673  0.355199 -1.663376
2  -2.532470 -1.694096 -0.432546 -0.341093
3  -1.198531 -0.384605 -0.368347  0.566197
4   0.505959 -0.615023 -1.316505  1.331835
5  -0.068528  0.102743 -0.235474  0.666361
6  -1.646008 -0.765082  0.756714  0.615528
7  -0.816201  2.411653 -0.878649  0.510363
8  -0.914156 -1.245752 -0.893270  0.433378
9   1.283184 -2.005857 -0.293617 -0.151975
10 -0.598430 -1.205000 -0.209753 -0.243291
11  0.897859  0.831789 -0.362199  0.718162
12  1.533647 -1.189756  0.538834  0.285050
13 -1.349351 -0.821386  1.516357  0.330736
14 -0.057641  0.165006  0.587258 -0.671662
15 -0.222375  0.201429  1.023988  0.365442
16 -0.722409  2.075656 -0.708131  0.049437
17  0.812610 -0.134202 -1.219731  0.376340
18  1.644310  0.931820  0.283015 -0.669808
19 -1.232661  1.162186  0.126129  1.357174
20 -0.699622 -1.778351  2.441241 -0.993816
21 -3.291571 -0.033284 -1.046927  0.203041
22 -0.207087 -1.564522 -0.283407 -1.319987
23 -1.700432  0.098758 -0.780464 -0.529731
24 -0.058050  1.650126  0.496007  1.645966
25 -1.165334  0.762552 -1.963981  0.004354
26 -0.128509  1.289546  0.595402 -0.409122
27 -1.468812 -1.274961 -0.442755 -0.914892
28 -0.182299  0.163811  0.508904  0.751762
29  1.472406 -0.665502 -0.475159  1.069714
30  0.014979 -0.313594 -0.562988 -0.050088
31 -0.907394 -1.301312  1.224020  0.252917
32  0.790535  0.816258  1.134608  0.229913
33  0.092260 -2.172551 -0.399180 -0.260161
34  1.986861 -0.605954  0.025069  0.117047
35 -2.344467 -1.818681 -0.173265  0.509990
36 -1.281992 -0.766642  0.338510  1.072474
37 -0.502833  0.767331 -0.905428 -1.385045
38 -0.884941 -0.498249 -0.341377  0.565567
39  2.697299  0.457996  1.061381 -1.133273
40 -1.131026 -0.997799  1.455748 -0.680614
41  0.162183 -1.078826  1.875005  0.820358
42 -0.057483  1.144778  1.301616 -0.659844
43  0.018111 -0.552647 -0.284547  0.041761
44  1.466573  0.410361  0.846741  0.616687
45 -0.218987 -0.793900  0.861203  0.043323
46 -2.013277 -0.056525  0.227580 -0.317018
47 -0.538831  1.694163  0.391878 -1.061725
48 -0.116781  0.211711  0.856749 -1.275787
49  1.051444  0.954225 -0.688367 -1.645204

In [53]:
dataf.max()

A    2.697299
B    2.411653
C    2.441241
D    1.645966
dtype: float64